src/cf/src/Catalogs/ТелеграмБоты/ТелеграмБоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмБоты</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>Жетон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСохраненияФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияОбновлений</name>
    <type>
      <types>EnumRef.ТелеграмСпособыПолученияОбновлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебхукАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебхукКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСамозаверенныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PEMИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PEM</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйДоступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправкиСообщенийЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмСтатусыИспользования/ТелеграмСтатусыИспользования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСтатусыИспользования</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТелеграмСпособыПолученияОбновлений/ТелеграмСпособыПолученияОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСпособыПолученияОбновлений</name>
  <enumValues>
    <name>ПериодическийЗапрос</name>
  </enumValues>
  <enumValues>
    <name>Вебхуки</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмБоты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЭтоГруппа Тогда
		
		// Проверка уникальности ключа
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВебхукКлюч", ВебхукКлюч);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТелеграмБоты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТелеграмБоты КАК ТелеграмБоты
		|ГДЕ
		|	ТелеграмБоты.Ссылка <> &Ссылка
		|	И ТелеграмБоты.ВебхукКлюч = &ВебхукКлюч
		|	И ТелеграмБоты.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
		|	И ТелеграмБоты.СпособПолученияОбновлений = ЗНАЧЕНИЕ(Перечисление.ТелеграмСпособыПолученияОбновлений.Вебхуки)";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Отказ = Истина;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ТекстСообщения = СтрШаблон( НСтр("ru = 'Используемый бот с ключом %1 уже есть %2, задайте другой ключ.'"), 
								ВебхукКлюч, 
								Выборка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	
		Если ПометкаУдаления Тогда
			Статус = Перечисления.ТелеграмСтатусыИспользования.Выключен;
		КонецЕсли;
	
		Если Статус = Перечисления.ТелеграмСтатусыИспользования.Используется Тогда
			Если СпособПолученияОбновлений = Перечисления.ТелеграмСпособыПолученияОбновлений.ПериодическийЗапрос Тогда
				Если НЕ ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
					РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ТелеграмПолучитьОбновленияБота);
				Иначе
					РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
					Если РегламентноеЗадание = Неопределено Тогда
						РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ТелеграмПолучитьОбновленияБота);
					КонецЕсли;
				КонецЕсли;
				РегламентноеЗадание.Наименование = СтрШаблон("Телеграм бот %1, получение обновлений", Лев(Наименование, 25));
				РегламентноеЗадание.ИмяПользователя = ИмяПользователяРегламентногоЗадания;
				РегламентноеЗадание.Использование = Ложь;
				РегламентноеЗадание.Записать();
				ИдентификаторРегламентногоЗадания = РегламентноеЗадание.УникальныйИдентификатор;
			Иначе
				Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
					РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
					Если РегламентноеЗадание <> Неопределено Тогда
						РегламентноеЗадание.Удалить();
					КонецЕсли;
					ИдентификаторРегламентногоЗадания = Неопределено;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
				РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
				Если РегламентноеЗадание <> Неопределено Тогда
					РегламентноеЗадание.Удалить();
					ИдентификаторРегламентногоЗадания = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Прав(КаталогСохраненияФайлов, 1) = "\" Тогда
			КаталогСохраненияФайлов = Лев(КаталогСохраненияФайлов, СтрДлина(КаталогСохраненияФайлов) - 1);
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("НовоеРасписание") И ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
			Если РегламентноеЗадание <> Неопределено Тогда
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ДополнительныеСвойства.НовоеРасписание);
				Расписание = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("РасписаниеРегламентногоЗадания"));
				РегламентноеЗадание.Расписание = Расписание;
				РегламентноеЗадание.Записать();
			КонецЕсли;
		КонецЕсли;
	
		Если ДополнительныеСвойства.Свойство("СодержимоеСертификата") Тогда
			СодержимоеСертификата = Base64Значение(ДополнительныеСвойства.СодержимоеСертификата);
			PEM = Новый ХранилищеЗначения(СодержимоеСертификата);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Статус = Перечисления.ТелеграмСтатусыИспользования.Используется
		И СпособПолученияОбновлений = Перечисления.ТелеграмСпособыПолученияОбновлений.ПериодическийЗапрос Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
		Если РегламентноеЗадание <> Неопределено Тогда
			РегламентноеЗадание.Использование = Истина;
			РегламентноеЗадание.Параметры.Очистить();
			РегламентноеЗадание.Параметры.Добавить(Ссылка);
			РегламентноеЗадание.Записать();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
